ednieuw/Arduino-ESP32-Nano-Wordclock/Old/ESP32_WordClockV206/ESP32_WordClockV206.ino
    case 'R':                                                                                 // Reset to default settings
      if(InputString.equals("RRRRR"))                                                         // Delete WIFI settings and set defaults
      {
        Reset();
        ResetCredentials();
        shouldReboot = true; // ESP.restart();
        break;
      }
      if(InputString.equals("RRR"))                                                           // Delete WIFI settings only
       { 
        ResetCredentials();
        snprintf(sptext, sizeof(sptext), "\nSSID and password deleted. \nWIFI, NTP and BLE is On\n Enter @ to restart");
        break;
       }
      if(len == 1)                                                                            // Set to default settings
        {
        Reset();
        snprintf(sptext, sizeof(sptext), "\nReset to default values: Done");                                                                // Force a minute update
        Displaytime(); Tekstprintln("");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault R. ****");
      break;
      
    case 'S':                                                                                 // Slope factor for brightness
      if(len > 1 && len < 5) 
       {
        Mem.LightReducer = (byte)SConstrainInt(InputString, 1, 1, 255);
        snprintf(sptext, sizeof(sptext), "Slope brightness changed to: %d%%", Mem.LightReducer);
       } 
      else snprintf(sptext, sizeof(sptext), "**** Input fault. \nEnter Snnn where n between 1 and 255");
      break;
      
    case 'T':                                                                                 // Time setting
      if(len == 7) 
       {
        timeinfo.tm_hour = (int)SConstrainInt(InputString, 1, 3, 0, 23);
        timeinfo.tm_min  = (int)SConstrainInt(InputString, 3, 5, 0, 59);
        timeinfo.tm_sec  = (int)SConstrainInt(InputString, 5, 7, 0, 59);
        SetRTCTime();                                                                         // Always sync ESP32 internal RTC
        if(DS3231Installed)
         {
          SetDS3231Time();                                                                    // Write time to DS3231
          Mem.UseDS3231 = 1;                                                                 // Time source = DS3231
          Mem.NTPOn     = 0;                                                                 // NTP not needed
          Mem.WIFIOn    = 0;                                                                 // WIFI not needed
          StoreStructInFlashMemory();                                                        // Persist settings
          snprintf(sptext, sizeof(sptext), "Time set. DS3231=On, WIFI=Off, NTP=Off");
         }
        else
         {
          Mem.UseDS3231 = 0;
          snprintf(sptext, sizeof(sptext), "Time set (no DS3231). WIFI/NTP unchanged.");
         }
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter Thhmmss ****");
      break;
      
    case 'U':                                                                                 // Demo mode
      if(len == 1) 
      { 
        if(Demo)  {                     Demo = false; }                                       // Force a minute update and turn off demo mode
        else { MilliSecondValue = 200;  Demo = true;  }                                       // If Demomode was off turn it on with 200 msec delay 
        snprintf(sptext, sizeof(sptext), "Demo mode: %s, %d msec/min", Demo ? "ON" : "OFF", MilliSecondValue);    
       } 
      else if(len > 1 && len < 6) 
       {
        MilliSecondValue = InputString.substring(1, 5).toInt();
        Demo = true;
        snprintf(sptext, sizeof(sptext), "Demo mode: %s, %d msec/min", Demo ? "ON" : "OFF", MilliSecondValue);
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault U. Demo mode (Unnn or U) ****");
      break;
 
 case 'V':
     if (len == 1) 
       snprintf(sptext, sizeof(sptext), "Cleared background colour: 0X%08" PRIX32, Mem.DimmedLetter = 0);  // Reset to no background LEDs
     else if (parseColourInput(InputString, len, Mem.DimmedLetter)) 
       snprintf(sptext, sizeof(sptext), "**** Background font colour changed ****\nColour now: 0X%08" PRIX32, Mem.DimmedLetter);
     else
       snprintf(sptext, sizeof(sptext), "Enter Vwwrrggbb hexadecimal (0 - F)\nBackground colour Stored: 0X%08" PRIX32, Mem.DimmedLetter);
     Tekstprintln(sptext);
     LedsOff();                                                                              // Clear the display
     SetSecondColour();                                                                      // Set the colour per second of 'IS' and 'WAS'
     Displaytime(); Tekstprintln("");
     sptext[0] = 0;                                                                          // Suppress a second print of sptext
     break;

    case 'W':                                                                                 // WIFI toggle
      if(len == 1) 
       {
        Mem.WIFIOn = 1 - Mem.WIFIOn;
        Mem.NTPOn = Mem.WIFIOn;                                                               // If WIFI is off turn NTP also off
        snprintf(sptext, sizeof(sptext), "WIFI is %s after restart", Mem.WIFIOn ? "ON" : "OFF");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter W ****");
      break;
      
    case 'X':                                                                                 // NTP toggle
      if(len == 1) 
       {
        Mem.NTPOn = 1 - Mem.NTPOn;
        snprintf(sptext, sizeof(sptext), "NTP is %s after restart", Mem.NTPOn ? "ON" : "OFF");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter X ****");
      break;
      
    case 'Y':                                                                                 // LEDtest
      if(len == 1) 
       {
        LEDtest();                                                                     // Force a minute update
        snprintf(sptext, sizeof(sptext), "**** LED test");
       }
      break;
      
