ednieuw/Arduino-ESP32-Nano-Wordclock/Old/ESP32_WordClockV206/ESP32_WordClockV206.ino
//--------------------------------------------                                                //
// NTP Notify
//--------------------------------------------
void NTPnotify(struct timeval* tv) { ntpJustSynced = true; }                                  // --- NTP time synchronized --- is printed later
//--------------------------------------------                                                //
// NTP Check and Print NTP if synced
//--------------------------------------------
void CheckandPrintNTPsynced(void)
{
 struct tm tm;
 time_t now = time(nullptr);
 localtime_r(&now, &tm); 
 if (Mem.TimeLogPrint != 0 )                                              // Do not print time but do update the display                                                              // do not Print the time string every minute
   { 
    Tekstprintlnf("-- NTP time synchronized --  %02d-%s-%04d %02d:%02d:%02d ",
           timeinfo.tm_mday,  monthNames[timeinfo.tm_mon],   // tm_mon is 0–11
           timeinfo.tm_year + 1900, timeinfo.tm_hour,
           timeinfo.tm_min,          timeinfo.tm_sec);
   }       
 ntpJustSynced = false;
}
//--------------------------------------------                                                //
// NTP Set time zone
//--------------------------------------------
void setTimezone() { setenv("TZ", Mem.Timezone, 1);  tzset(); }
//--------------------------------------------                                                //
// NTP Init NTP
//--------------------------------------------
void initSNTP() 
{  
 sntp_set_time_sync_notification_cb(NTPnotify);                                               // Optional: callback when time syncs
 configTime(0, 0, "pool.ntp.org", "time.nist.gov");                                           // 1 hour sync interval = default
 setTimezone();                                                                               // Must be set after configTime
}
//--------------------------------------------                                                //
// NTP Get a NTP time and wait max 2.5 sec 
//--------------------------------------------
bool wait4SNTP() 
{
 int32_t Tick = millis(); 
 bool SNTPtimeValid = true;
 while (sntp_get_sync_status() != SNTP_SYNC_STATUS_COMPLETED) 
  { if ((millis() - Tick) >2500) {SNTPtimeValid = false; break;}   }                          // Wait max 2.5 seconds 
return  SNTPtimeValid;
}

//--------------------------------------------                                                //
// WIFI Check for a Pending command received from the web page 
// Log SWversion to web page when Log = true
//--------------------------------------------
void BuildHTMLPage(bool Log)                                                                   // Build HTML_page from current state. log=true: menu also goes to log (use for i/ii)
{
 int i = 0, n;
 html_info[0] = 0;
 DoNotLog = !Log;                                                                              // Suppress log output unless explicitly requested (i/ii)
 SWversion();
 DoNotLog = false;
 for (n=0;n<strlen(index_html_top);n++)       HTML_page[i++] = (char) index_html_top[n];
 if (i <= MAXSIZE_HTML_PAGE - 999)
  {
   for (n=0;n<strlen(html_info);n++)          HTML_page[i++] = (char) html_info[n];
   for (n=0;n<strlen(index_html_footer);n++)  HTML_page[i++] = (char) index_html_footer[n];
  }
 else strcat(HTML_page, "<br> Send I for menu\n*** INCREASE MAXSIZE_HTML_PAGE in Webpage.h ***<br><br><br>");
 HTML_page[i] = 0;
}
//--------------------------------------------                                                //
// WIFI CheckWIFIcommand
//--------------------------------------------
void CheckWIFIcommand(void)
{
 if (PendingCommand.length() > 0)
  {
   ReworkInputString(PendingCommand);
   BuildHTMLPage(false);                                                                      // Rebuild page after command; no logging (only i/ii should log the menu) 
  }
}
//--------------------------------------------                                                //
// WIFI WEBPAGE
//--------------------------------------------
void WebPage(void)
{
 BuildHTMLPage(true);                                                                         // Build initial page at startup with logging enabled
 server.on("/", HTTP_GET, [](AsyncWebServerRequest *request)                                  // Send web page with input fields to client
   {  request->send(200, "text/html",(const char*) HTML_page  );  }    ); 
 server.on("/log", HTTP_GET, [](AsyncWebServerRequest *request)                               // Serve the log viewer HTML page
   {  request->send(200, "text/html", logData);    });                                        // Serve the HTML page from LogViewer.h
 server.on("/tekstprint",  HTTP_GET, HandleTekstPrint);                                       // LOGBUFFER Printlast 500 lines
 server.on("/tekstdownload", HTTP_GET, HandleTekstDownload);                                  // LOGBUFFER Stream all the circular log buffer directly to the client
 server.on("/get", HTTP_GET, [] (AsyncWebServerRequest *request)
   {
    String inputMessage;
    if (request->hasParam(PARAM_INPUT_1)) {inputMessage = request->getParam(PARAM_INPUT_1)->value();}
    PendingCommand = inputMessage;                                                            //  Command → queue it and redirect
    request->redirect("/wait");
});
 server.on("/wait", HTTP_GET, [](AsyncWebServerRequest *request)
   {
   if (PendingCommand.length() == 0) { request->redirect("/"); return; }                      // Command finished → show updated page
    request->send(200, "text/html",
        "<html><body>"
        "<h3>Processing command...</h3>"
        "<meta http-equiv='refresh' content='1'>"
        "</body></html>");
  });
 server.on("/update", HTTP_GET, [](AsyncWebServerRequest *request)                            // Serve the OTA upload page
    {  request->send(200, "text/html", OTA_html);});
 server.on("/update", HTTP_POST, [](AsyncWebServerRequest *request)                           // Handle the actual OTA upload
   {
    shouldReboot = !Update.hasError();
    AsyncWebServerResponse *response = request->beginResponse(
        200, "text/plain", shouldReboot ? "OK" : "FAIL");
    response->addHeader("Connection", "close");
    request->send(response);
   },  
  [](AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final) 
   {
    if (!index) 
      {
       Tekstprintf("OTA Start: %s\n", filename.c_str());
       if (!Update.begin(UPDATE_SIZE_UNKNOWN)) { Update.printError(Serial); }
      }
    if (Update.write(data, len) != len) { Update.printError(Serial); }
    if (final) 
      {
       if (Update.end(true)) { Tekstprintf("OTA Success: %u bytes\n", index + len);  } 
       else {Update.printError(Serial); }
      }
   });
 server.onNotFound(notFound);
 server.begin();
}

//--------------------------------------------                                                //
// WIFI WEBPAGE 
//--------------------------------------------
void notFound(AsyncWebServerRequest *request) 
{
 request->send(404, "text/plain", "Not found");
}

//--------------------------------------------                                                //
// WIFI WEBPAGE Login credentials Access Point page with 192.168.4.1
//--------------------------------------------
void StartAPMode(void) 
{
 InApMode = true;
 Mem.WIFIcredentials = IN_AP_NOT_SET;
 WiFi.softAP(AP_SSID, AP_PASSWORD);
 dnsServer.start(53, "*", WiFi.softAPIP());
 Tekstprintln("\nConnect to StartWordcock in WIFI on your mobile.\nEnter password: wordclock\nThen in URL: 192.168.4.1 and enter router credentials");   
 server.on("/", HTTP_GET, [](AsyncWebServerRequest *request)
  { request->send(200,"text/html",SoftAP_html);  });
 server.on("/", HTTP_POST, [](AsyncWebServerRequest *request)
   {
    int params = request->params();
    for (int i = 0; i < params; i++) 
      {
       const AsyncWebParameter* p = request->getParam(i);
       if (p->name() == "ssid") { strcpy(Mem.SSID,p->value().c_str());       }
       if (p->name() == "pass") { strcpy(Mem.Password , p->value().c_str()); }
      }
    StoreStructInFlashMemory();
    server.on("/", HTTP_GET, [](AsyncWebServerRequest *request)                               // Send web page with input fields to client
      { request->send(200, "text/plain", "Credentials saved. Restarting...");  } );  
    Mem.WIFIcredentials = SET;
    StoreStructInFlashMemory();  
    delay(300);
    InApMode = false;
    ESP.restart();
   });
 server.begin();
 Tekstprintln("AP Mode Started");
 Tekstprintlnf("AP SSID: %s", AP_SSID);
 IPAddress ip = WiFi.softAPIP();
 Tekstprintlnf("AP IP Address: %u.%u.%u.%u", ip[0], ip[1], ip[2], ip[3]);
}

//--------------------------------------------                                                //
// WIFI WPS functions
//--------------------------------------------
void wpsInitConfig()
{
 config.wps_type = ESP_WPS_MODE;
 strcpy(config.factory_info.manufacturer, ESP_MANUFACTURER);
 strcpy(config.factory_info.model_number, ESP_MODEL_NUMBER);
 strcpy(config.factory_info.model_name, ESP_MODEL_NAME);
 strcpy(config.factory_info.device_name, ESP_DEVICE_NAME);
}

void wpsStart()
{
 if(esp_wifi_wps_enable(&config))  Tekstprintln("WPS Enable Failed");
 else if(esp_wifi_wps_start(0)) 	 Tekstprintln("WPS Start Failed");
}

void wpsStop()
{
 if(esp_wifi_wps_disable()) 	     Tekstprintln("WPS Disable Failed");
}

String wpspin2string(uint8_t a[])
{
 char wps_pin[9];
 for(int i=0;i<8;i++){ wps_pin[i] = a[i]; }
 wps_pin[8] = '\0';
 return (String)wps_pin;
}
//--------------------------------------------                                                //
// End WPS
//--------------------------------------------

                                  #ifdef ONEWIREKEYPAD3x4
//--------------------------------------------                                                //
// KEYPAD check for Onewire Keypad input
//--------------------------------------------
void OnewireKeypad3x4Check(void)
{
 int keyvalue=99;
 int Key=0;
 int sensorValue = analogRead(OneWirePin); // read the value from the sensor:
 switch(sensorValue)
  {
    case   0 ... 100:  keyvalue = 13; break;   // noise
    case 101 ... 132:  keyvalue = 12; Key = '*'; break;   // * 
    case 133 ... 154:  keyvalue =  0; Key = '0'; break;   // 0 
    case 155 ... 216:  keyvalue = 11; Key = '#'; break;   // # 
    case 217 ... 281:  keyvalue =  7; Key = '7'; break;   // 7 
    case 282 ... 318:  keyvalue =  4; Key = '4'; break;   // 4 
    case 319 ... 349:  keyvalue =  1; Key = '1'; break;   // 1 
    case 350 ... 390:  keyvalue =  8; Key = '8'; break;   // 8 
    case 391 ... 463:  keyvalue =  5; Key = '5'; break;   // 5 
    case 464 ... 519:  keyvalue =  2; Key = '2'; break;   // 2 
    case 520 ... 619:  keyvalue =  9; Key = '9'; break;   // 9 
    case 620 ... 848:  keyvalue =  6; Key = '6'; break;   // 6 
    case 849 ... 1023: keyvalue =  3; Key = '3'; break;   // 3
  }
 if(keyvalue<13) { Tekstprintlnf("Key: %s",Key); delay(300); }
  if (Key == 12)   // *                                                                       // Pressing a * activates the keyboard input. 
   {  
    KeyInputactivated = true;
    KeyLooptime = millis();
    KeypadString ="";
    ColorLeds("",0,NUM_LEDS-1,0x00FF00);                                                      // Turn all LEDs green
    ShowLeds();                                                                               // Push data in LED strip to commit the changes
    Tekstprintln("Key entry activated");
   }
 if (KeyInputactivated && (Key>=0 && Key<10))
   {
    delay(20); 
    KeypadString += Key;                                                                      // Digit keys 0 - 9
    ColorLeds("",0,Key-48,0xFF0000);                                                          // Turn all LEDs red
    ShowLeds();                                                                               // Push data in LED strip to commit the changes
 //   Tekstprintln(KeypadString);
   }
 if (KeypadString.length()>5)                                                                 // If six numbers are entered rework this to a time hhmmss
   {       
   if(KeypadString=="999999")
     { 
      KeypadString = "";   
      Reset();
      Tekstprintln("Settings reset");   
     }
    else 
     {      
      ReworkInputString(KeypadString);                                                        // Rework ReworkInputString();
      KeypadString = "";
      Tekstprintln("Time changed");
     }    
   }
 if ( KeyInputactivated && ((millis() - KeyLooptime) > 30000) ) 
   {  
    KeyInputactivated = false;                                                                // Stop data entry after 30 seconds. This avoids unintended entry 
    KeypadString ="";
    Tekstprintln("Keyboard entry stopped");
  }
}
                                  #endif  //ONEWIREKEYPAD3x4  
                                  #ifdef ONEWIREKEYPAD3x1
//--------------------------------------------                                                //
// KEYPAD check for Onewire Keypad input with 5V and 1.1, 4.7, 4.7, 4.7 kOhm resistors
//--------------------------------------------
void OnewireKeypad3x1Check(void)
{
 int8_t keyvalue = 99;
 int8_t Key;
 int16_t sensorValue = analogRead(OneWirePin);                                                // Read the value from the sensor:
 switch(sensorValue)
   {
    case   0 ... 385:  keyvalue = 99;            break;                                       // Noise
    case 386 ... 635:  keyvalue = -1; Key = 'G'; break;                                       // G 
    case 636 ... 910:  keyvalue =  0; Key = 'Y'; break;                                       // Y 
    case 911 ... 1024: keyvalue =  1; Key = 'R'; break;                                       // R 
   }
 if(keyvalue<2) 
    { 
//     Serial.print(sensorValue); Serial.println(Key); 
     if (Key == 'R') ProcessKeyPressTurn(1);                                                  // Pressing Red increases hour or minute. 
     if (Key == 'G') ProcessKeyPressTurn(-1);                                                 // Pressing Green decreases hour or minute. 
     if (Key == 'Y') ProcessKeyPressTurn(0);                                                  // Pressing Yellow activates the keyboard input. 
     delay(200);     
    }
}
                                  #endif //ONEWIREKEYPAD3x1
//--------------------------------------------                                                //
// KEYPAD 3x1 Init 
//--------------------------------------------
 void InitKeypad3x1(void)
 {
 digitalWrite(COLPIN,LOW);
 snprintf(sptext, sizeof(sptext),"3*1 keypad %s used", Mem.TimeInput==2?"IS":"NOT");

